app/controllers/users_controller.rb

 def create
 paramHash=params[:user]
 userID=User.find_by_user_id(paramHash[:user_id].strip)
 if userID == nil
  @user = User.create_user! paramHash
---
SELECT "users".* FROM "users" WHERE "users"."user_id" = 'shivam' LIMIT 1
INSERT INTO "users" ("created_at", "email", "session_token", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", Sat, 04 Oct 2014 22:05:46 UTC +00:00], ["email", "1234"], ["session_token", nil], ["updated_at", Sat, 04 Oct 2014 22:05:46 UTC +00:00], ["user_id", "shivam"]]